<p class="par"><b>Read on Russian, please</b></p>
<hr/>
<p class="par"><b>Цель данного проекта</b><br/>
Цель - создать небольшой набор утилит, которые будут полезны вебмастеру или программисту. Те небольшие задачки, ради которых подчас лень писать скрипт или программу реализованы здесь. Сгенерировать TimeStamp или быстро провернуть строку через ряд функций? Вам сюда.</p>
<p class="par">Разумеется, в будущем планируется расширение и улучшение проекта. С вопросами и предложениями пишите: {{mailto address="admin@berenices.net" encode="javascript" subject="Berenices.Net Tools"}}</p>
<p class="par"><b>Почему всё по-английски?</b><br/>
Причина - банальная лень :) Эти страницы я создавал не в <i>Microsoft &reg; Word &trade;</i> и частое переключение раскладки утомляет. Тем более, я уверен, что тем, кому пригодятся эти штуки и так будут владеть достаточным уровнем технического английского что бы разобраться в этих нехитрых полезняшках.</p>
<p class="par"><b>Какая тебе от этого выгода?</b><br/>
Куча сэкономленного времени и нервов :)</p>
<p class="par"><b>История</b><br/>
Первый вариант "набора утилит" был написан в далёком январе 2008 года. Программа просто брала строку и делала с ней разные штуки: <i>base64</i>, <i>unescape</i> и т.п. Я длительное время пользовался ею, но вскоре функционала стало не хватать. И вот результат - он перед вами :) Текущая версия программы: <b>{{$version}}</b> .<br/>
P.S. Старая версия скрипта доступна <a href="{{$url_abs}}/old-wt/" target="_blank">здесь</a>.</p>
